AppAcademy/Homework/W10D1/capybara_rspec/app/views/bands/index.html.erb

<ul>
  <% Band.all.each do |band| %>
---
SELECT "bands".* FROM "bands"