aA-classwork/week 9/W9D5/music_app/app/views/albums/edit.html.erb

        <select name="album[band_id]" id="album_artist">
            <% Band.all.each do |band|  %>
---
SELECT "bands".* FROM "bands"