aA-classwork/week 9/W9D5/music_app/app/views/albums/show.html.erb


    <% @album.tracks.each do |track|%>
---
SELECT "tracks".* FROM "tracks" WHERE "tracks"."album_id" = $1  [["album_id", 1]]