container2/appacademy/dayswork/W5D2/art_share/app/models/collection.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def self.collections_for_user(user_id)
    user = User.find(user_id)