container2/appacademy/dayswork/W5D2/art_share/app/models/like.rb

  def self.users_liking_artwork(artwork_id)
    Artwork.find(artwork_id).users_liking
---
SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def self.users_liking_comment(comment_id)
    Comment.find(comment_id).users_liking
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def self.items_liked_by_user(user_id)
    liked_artworks = User.find(user_id).liked_artworks.to_a
    liked_comments = User.find(user_id).liked_comments.to_a
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]