container2/aA-classwork/week 10/W10D4/Blueit/app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 AND (parent_comment_id IS NULL)  [["post_id", 1]]
---
<br>
<% @post.top_level_comments.each do |comment| %>