container2/aA-classwork/week 10/W10D4/Blueit/app/views/subs/show.html.erb

<br><br>
<% @sub.posts.each do |post| %>
---
SELECT "posts".* FROM "posts" INNER JOIN "post_subs" ON "posts"."id" = "post_subs"."post_id" WHERE "post_subs"."sub_id" = $1  [["sub_id", 1]]