container/AppAcademy/Curriculum/03 Rails/W10D4 Advanced Rails Forms/! Submissions/reddit_clone/app/controllers/posts_controller.rb

  def create
    # debugger
    @post = Post.new(post_params)
    @post.author_id = current_user.id
    if @post.save
---
INSERT INTO "posts" ("title", "url", "content", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "THIRD"], ["url", ""], ["content", "TO ALL SUBS!"], ["author_id", 2], ["created_at", "2019-04-18 23:14:54.594250"], ["updated_at", "2019-04-18 23:14:54.594250"]]