aA-classwork/week 9/W9D5/music_app/app/views/tracks/edit.html.erb

        <select name="track[album_id]" id="album_id">
            <% Album.all.each do |album| %>
---
SELECT "albums".* FROM "albums"