AppAcademy/Curriculum/03 Rails/W_9D2 Controllers Continued/! Submissions/art_share_api/app/controllers/artworks_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def index
    # artwork = Artwork.find_by(id: params[:id])
    # render json: Artwork.all

    user = User.find(params[:user_id])