container2/appacademy/dayswork/W5D2/art_share/app/controllers/collections_controller.rb

SELECT  "collections".* FROM "collections" WHERE "collections"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    render json: Collection.find(params[:id])

INSERT INTO "collections" ("user_id", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["name", "Favorites"], ["created_at", "2019-04-09 22:44:32.254506"], ["updated_at", "2019-04-09 22:44:32.254506"]]
---
  def create
    collection = Collection.new(collection_params)
    if collection.save

SELECT  "collections".* FROM "collections" WHERE "collections"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "collections" SET "name" = $1, "updated_at" = $2 WHERE "collections"."id" = $3  [["name", "Best"], ["updated_at", "2019-04-09 22:47:01.476353"], ["id", 1]]
---
  def update
    collection = Collection.find(params[:id])
    if collection.update(collection_params)

SELECT  "collections".* FROM "collections" WHERE "collections"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "collections" WHERE "collections"."id" = $1  [["id", 1]]
---
  def destroy
    collection = Collection.find(params[:id])
    collection.destroy