container2/appacademy/dayswork/W5D2/art_share/app/controllers/likes_controller.rb

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "likes" ("likeable_type", "likeable_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["likeable_type", "Artwork"], ["likeable_id", 1], ["user_id", 1], ["created_at", "2019-04-09 19:53:20.313334"], ["updated_at", "2019-04-09 19:53:20.313334"]]
---
  def create
    if like_params[:artwork_id]
      likeable = Artwork.find(like_params[:artwork_id])
    else
      likeable = Comment.find(like_params[:comment_id])
    end
    like = Like.new(
      {
        user_id: like_params[:user_id],
        likeable: likeable,
      }
    )
    if like.save

SELECT  "likes".* FROM "likes" WHERE "likes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 1]]
---
  def destroy
    like = Like.find(params[:id])
    like.destroy