container2/appacademy/dayswork/W5D2/art_share/app/controllers/users_controller.rb

  def index
    if user_params[:username]
      render json: User.where(username: user_params[:username])
    else
      render json: User.all
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1  [["username", "civicdrainer"]]
SELECT "users".* FROM "users"

  def update
    user = User.find(params[:id])
    if user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "email" = $1, "name" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["email", "Bar22"], ["name", "Foo22"], ["updated_at", "2019-04-08 20:59:16.520556"], ["id", 3]]