appacademy/dayswork/W5D3/cats_99/app/views/cats/show.html.erb


  <% @cat.rental_requests.each do |request| %>
---
SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1  [["cat_id", 1]]