aA-classwork/week 9/W9D5/music_app/app/views/bands/show.html.erb

<div class="bands">
    <% @band.albums.each do |album| %>
---
SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = $1  [["band_id", 1]]