container/AppAcademy/Curriculum/04 JavaScript/W12D3 AJAX/! Submissions/ajax_twitter/app/controllers/users_controller.rb

  def create
    # sign up the user
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def search
    @users = if params[:query].present?
               User.where('username ~ ?', params[:query])
---
SELECT "users".* FROM "users" WHERE (username ~ 'jmwr')