container2/appacademy/dayswork/W6D4/RedditClone/app/controllers/subs_controller.rb

INSERT INTO "subs" ("title", "description", "moderator_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "My First Sub!!"], ["description", "Here's the descroption"], ["moderator_id", 2], ["created_at", "2019-04-18 23:20:26.135949"], ["updated_at", "2019-04-18 23:20:26.135949"]]
---
  def create
    @sub = current_user.subs.new(sub_params) #creating a new sub which automatically belongs to this user through an association.
    if @sub.save