container/AppAcademy/Curriculum/03 Rails/W_9D3 Rails Views/ninety_nine_cats/app/controllers/cats_controller.rb

SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "updated_at" = $2 WHERE "cats"."id" = $3  [["color", "persian-blue"], ["updated_at", "2019-04-10 21:11:36.220888"], ["id", 2]]
---
  def update
    @cat = Cat.find_by(id: params[:id])
    if @cat.update(cat_params)