aA-classwork/week 9/W9D5/music_app/app/models/user.rb

    def reset_session_token!
        self.session_token = User.generate_session_token
        self.save!
---
INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "hctTMQ4bqdhdo028tcSm_w"], ["updated_at", "2019-04-12 17:51:04.520279"], ["id", 1]]