aA-classwork/week 9/W9D5/music_app/app/controllers/albums_controller.rb

    def create
        @album = Album.new(album_params)
        if @album.save
---
INSERT INTO "albums" ("band_id", "title", "year", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["band_id", 1], ["title", "Currents"], ["year", 2015], ["created_at", "2019-04-12 21:24:09.966281"], ["updated_at", "2019-04-12 21:24:09.966281"]]

    def destroy
        @album = Album.find(params[:id])
        @album.destroy!
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 3]]