aA-classwork/week 9/W9D5/music_app/app/controllers/tracks_controller.rb

    def create
        @track = Track.new(track_params)
        if @track.save
---
INSERT INTO "tracks" ("album_id", "title", "track_number", "lyrics", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["album_id", 1], ["title", "Let It Happen"], ["track_number", 1], ["lyrics", ""], ["created_at", "2019-04-12 22:57:42.344639"], ["updated_at", "2019-04-12 22:57:42.344639"]]

    def update
        @track = Track.find(params[:id])
        if @track.update_attributes(track_params)
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "tracks" SET "lyrics" = $1, "updated_at" = $2 WHERE "tracks"."id" = $3