container/AppAcademy/Curriculum/03 Rails/W10D1 Testing with Rails/! Solutions/solution/app/views/users/show.html.erb

SELECT "goals".* FROM "goals" WHERE "goals"."user_id" = $1  [["user_id", 6]]
---
    <ul>
      <% @user.goals.each do |goal| %>